АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/алк_УстановкаФактическихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаФактическихПоказателей</name>
  <registerRecords>InformationRegister.алк_ФактическиеПоказателиПроизводства</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ФактическиеПоказателиПроизводства/алк_ФактическиеПоказателиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ФактическиеПоказателиПроизводства</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	//проверка, что нет повторов
	
	//получаем колонку с показателями
	ВсеПоказатели = Показатели.Выгрузить(,"Показатель").ВыгрузитьКолонку("Показатель"); 
	РазличныеПоказатели = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеПоказатели); 
	//\\
	КоличествоПовторов = 0;
	
	Для Каждого эл ИЗ РазличныеПоказатели Цикл
		
		НайденныеСтроки = Показатели.НайтиСтроки(Новый Структура("Показатель", эл)); //все строки по показателю  
		
		ТЗПоПоказателю = ПреобразованиеМассивКоллекцийВТаблицуЗначений(НайденныеСтроки);   
		
		Периоды = ТЗПоПоказателю.ВыгрузитьКолонку("Период"); 
		РазличныеПериоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Периоды); 
		
		Смены = ТЗПоПоказателю.ВыгрузитьКолонку("Смена");
		РазличныеСмены = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Смены);   
		
		
		Если Периоды.Количество() <> РазличныеПериоды.Количество() Тогда //имеет смысл, если нет смен
			Для Каждого эл ИЗ РазличныеПериоды Цикл
				НайденныеСтрокиПоПоказателюИПериоду = ТЗПоПоказателю.НайтиСтроки(Новый Структура("Период",эл));
				Если НайденныеСтрокиПоПоказателюИПериоду.Количество() > 1 Тогда
					Для Каждого эл ИЗ РазличныеСмены Цикл
						ТЗПоПоказателюИПериоду = ПреобразованиеМассивКоллекцийВТаблицуЗначений(НайденныеСтрокиПоПоказателюИПериоду);
						ТЗПоПоказателюИПериодуИСмене = ТЗПоПоказателюИПериоду.НайтиСтроки(Новый Структура("Смена",эл));
						Если ТЗПоПоказателюИПериодуИСмене.Количество() > 1 Тогда 
							Сообщить(СтрШаблон("Найдены одинаковые строки по показателю ""%1"" !",НайденныеСтроки[0].Показатель)); 
							КоличествоПовторов = КоличествоПовторов + 1;
							Для Каждого эл ИЗ ТЗПоПоказателюИПериодуИСмене Цикл 
								Сообщить(СтрШаблон("№ %1",эл.НомерСтроки)); 
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//\\ 
	
	Если КоличествоПовторов <> 0 Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//проверка отсутствия таких записей в регистре
	МассивСообщений = Новый Массив;
	
	Для Каждого стр ИЗ Показатели Цикл  
		Запись = ВернутьЗаписьИзРегистра(стр.Период,стр.Показатель,стр.Смена); 
		
		Если Запись <> Неопределено И Запись.Регистратор <> Ссылка Тогда
			МассивСообщений.Добавить(СтрШаблон("Запись № %1 уже есть в документе ""%2"" в строке № %3!",стр.НомерСтроки,Запись.Регистратор,Запись.НомерСтроки));
		КонецЕсли;	
		
	КонецЦикла;
	
	Если МассивСообщений.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого эл ИЗ МассивСообщений Цикл 
		Сообщить(эл); 
	КонецЦикла;
	//\\
	
	Отказ = Истина;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.алк_УстановкаФактическихПоказателей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	Документы.алк_УстановкаФактическихПоказателей.ДобавитьДвижениеРегистраФактическиеПоказателиПроизводства(ЭтотОбъект, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры 

//возвращает записи из регистра алк_ФактическиеПоказателиПроизводства, если они уже есть
Функция ВернутьЗаписьИзРегистра(Период,Показатель,Смена)
	
	Записи = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФактическиеПоказателиПроизводства.Регистратор,
	               |	алк_ФактическиеПоказателиПроизводства.НомерСтроки
	               |ИЗ
	               |	РегистрСведений.алк_ФактическиеПоказателиПроизводства КАК алк_ФактическиеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ФактическиеПоказателиПроизводства.Период = &Период
	               |	И алк_ФактическиеПоказателиПроизводства.Показатель = &Показатель
	               |	И алк_ФактическиеПоказателиПроизводства.Смена = &Смена";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Показатель", Показатель); 
	Запрос.УстановитьПараметр("Смена", Смена);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	
	//Возврат Неопределено;
	
КонецФункции
Функция ПреобразованиеМассивКоллекцийВТаблицуЗначений(Массив)  
		
	ТЗ = Новый ТаблицаЗначений; 
	
	ТЗ.Колонки.Добавить("НомерСтроки");  
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("Смена");
	//ТЗ.Колонки.Добавить("");
	
	
	Для Каждого СтрокаМассива Из Массив Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.НомерСтроки = СтрокаМассива.НомерСтроки;
		НоваяСтрока.Период = СтрокаМассива.Период;
		НоваяСтрока.Смена = СтрокаМассива.Смена;
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции
